[
    {
      "url": "https://www.linkedin.com/jobs/view/accountant-at-escbv-4126161729?lg=en&_l=en",
      "job_posting_id": "4126161729",
      "job_title": "Accountant",
      "company_name": "ESCbv",
      "company_id": "1696201",
      "job_location": "Ghent, Flemish Region, Belgium",
      "job_summary": "Als gedreven Accountant met een passie voor cijfers en financiële processen, ben jij onze expert voor alle financiële administratie. Je zorgt voor een nauwkeurige boekhouding en biedt ondersteuning bij financiële analyses en rapportages Ontdek hoe jij met jouw oog voor detail een echte meerwaarde kan zijn voor onze finance afdeling! Dit is écht je ding: Als Accountant ondersteun jij onze verschillende business units, klanten en partners. Je bent samen met jouw collega’s verantwoordelijk voor het volledige boekhoudproces, van het inboeken van facturen tot het correct uitvoeren van de closing. Dit is hoe jij impact maakt: Je zorgt samen met collega’s voor een correcte maandelijkse afsluit voor onze verschillende Belgische vennootschappen Je doet nazicht op de balans, de P&L en de overlopende rekeningen Je zorgt dat verschillende verrichtingen & facturen ingeboekt worden en verwerkt aankoopfacturen Je zorgt voor het nodige debiteurenbeheer Met jouw nauwkeurige aanpak & proactieve houding zorg jij ervoor dat onze business blijft draaien en dat betalingen tijdig de deur uit kunnen! Ben jij de juiste match? Accountancy kennis & ervaring : Je hebt een diploma in accountancy of een vergelijkbare financiële opleiding en hebt reeds enkele jaren ervaring als accountant Nauwkeurig met een oog voor detail: Dankzij jouw alziend oog kruipen er geen fouten in de boekhouding, je kijkt alles steeds grondig na en weet discrepanties tijdig op te sporen Ervaring met ERP-pakketten: Je hebt in het verleden reeds gewerkt met een ERP pakket, bij voorkeur met Business central Doelgericht en gedreven: Jij weet als geen ander hoe belangrijk een closing is en zorgt dan ook dat alles tijdig door kan gaan. Je hebt geen probleem met jezelf hiervoor flexibel opstellen. Wat bieden wij jou? Als Accountant kun je rekenen op een aantrekkelijk loonpakket , afgestemd op jouw ervaring, aangevuld met een reeks extralegale voordelen: Mobiliteitsbudget Netto-onkostenvergoeding Maaltijdcheques van 8 euro per gewerkte dag Ecocheques van 250 euro per jaar Hospitalisatieverzekering Groepsverzekering Eindejaarspremie via Payflip, waarmee je kunt kiezen voor extra verlofdagen, IT-materiaal voor thuis, fietslease, pensioensparen terugbetaling, en meer. Daarnaast vieren we samen successen en mijlpalen! Van feesten en sportactiviteiten tot samen ontspannen, met tal van leuke activiteiten zorgen we ervoor dat je een fijne band kan opbouwen met jouw collega’s. Waar kom je terecht? Binnen onze ESC Group, die inmiddels uit meer dan 700 experts bestaat, maak je deel uit van ons finance team. Hier verwelkomen maar liefst 8 enthousiaste collega’s jou met open armen. Binnen het team werken we voor de verschillende bedrijven in de groep, wat zorgt voor de nodige variatie! De sfeer binnen ons bedrijf omschrijven we het best met één woord: kameraadschap . Ondanks onze groei hechten we veel waarde aan een informele en persoonlijke werkomgeving, waar iedereen zich gewaardeerd en gerespecteerd voelt! Interesse? Solliciteer dan snel! We stemmen jouw persoonlijke zoektocht graag af op de onze! Samen verkennen we alle mogelijkheden, zodat we geen kans missen. Wat zijn de volgende stappen? Binnen een week nemen we contact met je op voor een telefonische kennismaking — een perfecte gelegenheid om elkaar beter te leren kennen en jouw zoektocht te bespreken! Daarna plannen we een uitgebreide online meeting . Vervolgens nodigen we je uit voor een technisch gesprek , waarin je onze werkomgeving kunt ontdekken en we dieper ingaan op jouw technische kennis. Als we samen tot de conclusie komen dat er een match is, ontvang je een loonvoorstel , altijd afgestemd op jouw ervaring en kennis. Heb je nog vragen? Stuur gerust een e-mail naar Tot snel! Show more Show less",
      "job_seniority_level": "Mid-Senior level",
      "job_function": "Accounting/Auditing and Finance",
      "job_employment_type": "Full-time",
      "job_industries": "IT Services and IT Consulting",
      "job_base_pay_range": null,
      "company_url": "https://be.linkedin.com/company/escbyalistar?trk=public_jobs_topcard-org-name",
      "job_posted_time": "1 year ago",
      "job_num_applicants": 25,
      "discovery_input": {
        "experience_level": null,
        "job_type": null,
        "remote": null,
        "selective_search": null,
        "time_range": null
      },
      "apply_link": null,
      "country_code": null,
      "title_id": "40",
      "company_logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFE8dXZNcvidg/company-logo_100_100/B4EZfue2y8HIAU-/0/1752052756071/escbv_logo?e=2147483647&v=beta&t=NbaaNxnavXELHDzEvoQYMktemEfTLFm-NIRW95sBQFw",
      "job_posted_date": "2025-02-17T18:34:12.590Z",
      "job_poster": {
        "name": null,
        "title": null,
        "url": null
      },
      "application_availability": false,
      "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Als gedreven Accountant met een passie voor cijfers en financi&#xEB;le processen, ben jij onze expert voor alle financi&#xEB;le administratie. Je zorgt voor een nauwkeurige boekhouding en biedt ondersteuning bij financi&#xEB;le analyses en rapportages<br><br>Ontdek hoe jij met jouw oog voor detail een echte meerwaarde kan zijn voor onze finance afdeling!<br><br><strong>Dit is &#xE9;cht je ding:<br><br></strong>Als Accountant ondersteun jij onze verschillende business units, klanten en partners. Je bent samen met jouw collega&#x2019;s verantwoordelijk voor het volledige boekhoudproces, van het inboeken van facturen tot het correct uitvoeren van de closing.<br><br><strong>Dit is hoe jij impact maakt:<br><br></strong><ul><li>Je zorgt samen met collega&#x2019;s voor een correcte maandelijkse afsluit voor onze verschillende Belgische vennootschappen</li><li>Je doet nazicht op de balans, de P&amp;L en de overlopende rekeningen</li><li>Je zorgt dat verschillende verrichtingen &amp; facturen ingeboekt worden en verwerkt aankoopfacturen</li><li>Je zorgt voor het nodige debiteurenbeheer<br><br></li></ul>Met jouw nauwkeurige aanpak &amp; proactieve houding zorg jij ervoor dat onze business blijft draaien en dat betalingen tijdig de deur uit kunnen!<br><br><strong>Ben jij de juiste match?<br><br></strong><ul><li>Accountancy kennis &amp; ervaring : Je hebt een diploma in accountancy of een vergelijkbare financi&#xEB;le opleiding en hebt reeds enkele jaren ervaring als accountant</li><li>Nauwkeurig met een oog voor detail: Dankzij jouw alziend oog kruipen er geen fouten in de boekhouding, je kijkt alles steeds grondig na en weet discrepanties tijdig op te sporen</li><li>Ervaring met ERP-pakketten: Je hebt in het verleden reeds gewerkt met een ERP pakket, bij voorkeur met Business central</li><li>Doelgericht en gedreven: Jij weet als geen ander hoe belangrijk een closing is en zorgt dan ook dat alles tijdig door kan gaan. Je hebt geen probleem met jezelf hiervoor flexibel opstellen.<br><br></li></ul><strong>Wat bieden wij jou? <br><br></strong>Als Accountant kun je rekenen op een aantrekkelijk loonpakket , afgestemd op jouw ervaring, aangevuld met een reeks extralegale voordelen:<br><br><ul><li>Mobiliteitsbudget</li><li>Netto-onkostenvergoeding</li><li>Maaltijdcheques van 8 euro per gewerkte dag</li><li>Ecocheques van 250 euro per jaar</li><li>Hospitalisatieverzekering</li><li>Groepsverzekering</li><li>Eindejaarspremie via Payflip, waarmee je kunt kiezen voor extra verlofdagen, IT-materiaal voor thuis, fietslease, pensioensparen terugbetaling, en meer.<br><br></li></ul>Daarnaast vieren we samen successen en mijlpalen! Van feesten en sportactiviteiten tot samen ontspannen, met tal van leuke activiteiten zorgen we ervoor dat je een fijne band kan opbouwen met jouw collega&#x2019;s.<br><br><strong>Waar kom je terecht?</strong> <br><br>Binnen onze ESC Group, die inmiddels uit meer dan 700 experts bestaat, maak je deel uit van ons finance team. Hier verwelkomen maar liefst 8 enthousiaste collega&#x2019;s jou met open armen. Binnen het team werken we voor de verschillende bedrijven in de groep, wat zorgt voor de nodige variatie!<br><br>De sfeer binnen ons bedrijf omschrijven we het best met &#xE9;&#xE9;n woord: <strong>kameraadschap</strong>. Ondanks onze groei hechten we veel waarde aan een informele en persoonlijke werkomgeving, waar iedereen zich gewaardeerd en gerespecteerd voelt!<br><br><strong>Interesse? Solliciteer dan snel!<br><br></strong>We stemmen jouw persoonlijke zoektocht graag af op de onze! Samen verkennen we alle mogelijkheden, zodat we geen kans missen.<br><br><strong>Wat zijn de volgende stappen?<br><br></strong>Binnen een week nemen we contact met je op voor een <strong>telefonische kennismaking</strong> &#x2014; een perfecte gelegenheid om elkaar beter te leren kennen en jouw zoektocht te bespreken! Daarna plannen we een <strong>uitgebreide online meeting</strong>. Vervolgens nodigen we je uit voor een <strong>technisch gesprek</strong>, waarin je onze werkomgeving kunt ontdekken en we dieper ingaan op jouw technische kennis.<br><br>Als we samen tot de conclusie komen dat er een match is, ontvang je een <strong>loonvoorstel</strong>, altijd afgestemd op jouw ervaring en kennis.<br><br>Heb je nog vragen? Stuur gerust een e-mail naar<br><br>Tot snel!\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"Show more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"Show less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
      "base_salary": {
        "currency": null,
        "max_amount": null,
        "min_amount": null,
        "payment_period": null
      },
      "salary_standards": null,
      "is_easy_apply": false
    },
    {
      "url": "https://www.linkedin.com/jobs/view/accountant-at-workday-4304285112?_l=en",
      "job_posting_id": "4304285112",
      "job_title": "Accountant",
      "company_name": "Workday",
      "company_id": "17719",
      "job_location": "Heredia, Heredia, Costa Rica",
      "job_summary": "Your work days are brighter here. At Workday, it all began with a conversation over breakfast. When our founders met at a sunny California diner, they came up with an idea to revolutionize the enterprise software market. And when we began to rise, one thing that really set us apart was our culture. A culture which was driven by our value of putting our people first. And ever since, the happiness, development, and contribution of every Workmate is central to who we are. Our Workmates believe a healthy employee-centric, collaborative culture is the essential mix of ingredients for success in business. That’s why we look after our people, communities and the planet while still being profitable. Feel encouraged to shine, however that manifests: you don’t need to hide who you are. You can feel the energy and the passion, it's what makes us unique. Inspired to make a brighter work day for all and transform with us to the next stage of our growth journey? Bring your brightest version of you and have a brighter work day here. At Workday, we value our candidates’ privacy and data security. Workday will never ask candidates to apply to jobs through websites that are not Workday Careers. Please be aware of sites that may ask for you to input your data in connection with a job posting that appears to be from Workday but is not. In addition, Workday will never ask candidates to pay a recruiting fee, or pay for consulting or coaching services, in order to apply for a job at Workday. About The Team Workday's Accounts Receivable Team is a diverse group of customer service focused people, with an invaluable mix of experience and backgrounds. Our team promotes Workday’s Core Values with ‘Employees’ being the first of them. This is why we: Empower you to follow your desired career path & achieve professional and personal goals Encourage work-life balance and wellbeing Are proud to champion equal opportunities for everyone. We are a global team but that doesn’t stop our sense of collaboration, supportiveness, and fun! About The Role Workday's Accounts Receivable Team is continuing to expand and we're seeking a skilled Accountant who wants to make their mark on a growing organization. This role will work with multiple departments within the company. To be successful in this role, the individual must be able to handle multiple deadlines, have strong analytical skills, be detail oriented, display a high level of organizational skills and enjoy collaborating with people with a diverse set of talent, in a dynamic fast-pace environment. Job responsibilities include but are not limited to: The preparation of customer invoices and invoice adjustments Investigate and resolve billing queries Create and maintain customer records Review customer contracts Assist with month end responsibilities Perform tax related tasks (including sales tax end user schedules) Assist with various projects About You EDUCATION AND EXPERIENCE: 3 - 5 years Accounting/Finance experience Bachelor’s degree in accounting/finance or equivalent is preferred Strong computer skills are necessary Strong understanding of GAAP Proven track record for creating process efficiencies and solving problems KEY COMPETENCIES: Strong analytic and problem-solving skills Organized, detail oriented and accurate Excellent oral, written and interpersonal communication skills Self-starter Demonstrated ability to interface with all levels of management Ability to work well within tight deadlines Customer service focused and solution oriented Our Approach to Flexible Work With Flex Work, we’re combining the best of both worlds: in-person time and remote. Our approach enables our teams to deepen connections, maintain a strong community, and do their best work. We know that flexibility can take shape in many ways, so rather than a number of required days in-office each week, we simply spend at least half (50%) of our time each quarter in the office or in the field with our customers, prospects, and partners (depending on role). This means you'll have the freedom to create a flexible schedule that caters to your business, team, and personal needs, while being intentional to make the most of time spent together. Those in our remote \"home office\" roles also have the opportunity to come together in our offices for important moments that matter. Are you being referred to one of our roles? If so, ask your connection at Workday about our Employee Referral process! , Show more Show less",
      "job_seniority_level": "Not Applicable",
      "job_function": "Accounting/Auditing and Finance",
      "job_employment_type": "Full-time",
      "job_industries": "Software Development",
      "job_base_pay_range": null,
      "company_url": "https://www.linkedin.com/company/workday?trk=public_jobs_topcard-org-name",
      "job_posted_time": "4 months ago",
      "job_num_applicants": 25,
      "discovery_input": {
        "experience_level": null,
        "job_type": null,
        "remote": null,
        "selective_search": null,
        "time_range": null
      },
      "apply_link": null,
      "country_code": null,
      "title_id": "40",
      "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQGKeNem9seahg/company-logo_100_100/company-logo_100_100/0/1730301071878/workday_logo?e=2147483647&v=beta&t=FJYUmru_dlKQAutQBwVzsrf0AX-aQGNf8kby2_FYa1g",
      "job_posted_date": "2025-10-20T18:26:28.963Z",
      "job_poster": {
        "name": null,
        "title": null,
        "url": null
      },
      "application_availability": false,
      "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong><strong>Your work days are brighter here.<br><br></strong></strong>At Workday, it all began with a conversation over breakfast. When our founders met at a sunny California diner, they came up with an idea to revolutionize the enterprise software market. And when we began to rise, one thing that really set us apart was our culture. A culture which was driven by our value of putting our people first. And ever since, the happiness, development, and contribution of every Workmate is central to who we are. Our Workmates believe a healthy employee-centric, collaborative culture is the essential mix of ingredients for success in business. That&#x2019;s why we look after our people, communities and the planet while still being profitable. Feel encouraged to shine, however that manifests: you don&#x2019;t need to hide who you are. You can feel the energy and the passion, it&apos;s what makes us unique. Inspired to make a brighter work day for all and transform with us to the next stage of our growth journey? Bring your brightest version of you and have a brighter work day here.<br><br>At Workday, we value our candidates&#x2019; privacy and data security. Workday will never ask candidates to apply to jobs through websites that are not Workday Careers.<br><br>Please be aware of sites that may ask for you to input your data in connection with a job posting that appears to be from Workday but is not.<br><br>In addition, Workday will never ask candidates to pay a recruiting fee, or pay for consulting or coaching services, in order to apply for a job at Workday.<br><br><strong>About The Team<br><br></strong>Workday&apos;s Accounts Receivable Team is a diverse group of customer service focused people, with an invaluable mix of<br><br>experience and backgrounds.<br><br>Our team promotes Workday&#x2019;s Core Values with &#x2018;Employees&#x2019; being the first of them. This is why we:<br><br><ul><li> Empower you to follow your desired career path &amp; achieve professional and personal goals</li><li> Encourage work-life balance and wellbeing</li><li> Are proud to champion equal opportunities for everyone.<br><br></li></ul>We are a global team but that doesn&#x2019;t stop our sense of collaboration, supportiveness, and fun!<br><br><strong>About The Role<br><br></strong>Workday&apos;s Accounts Receivable Team is continuing to expand and we&apos;re seeking a skilled Accountant who wants to make their mark on a growing organization. This role will work with multiple departments within the company. To be successful in this role, the individual must be able to handle multiple deadlines, have strong analytical skills, be detail oriented, display a high level of organizational skills and enjoy collaborating with people with a diverse set of talent, in a dynamic fast-pace environment.<br><br>Job responsibilities include but are not limited to:<br><br><ul><li> The preparation of customer invoices and invoice adjustments</li><li> Investigate and resolve billing queries</li><li> Create and maintain customer records</li><li> Review customer contracts</li><li> Assist with month end responsibilities</li><li> Perform tax related tasks (including sales tax end user schedules)</li><li> Assist with various projects<br><br></li></ul><strong>About You<br><br></strong>EDUCATION AND EXPERIENCE:<br><br><ul><li> 3 - 5 years Accounting/Finance experience</li><li> Bachelor&#x2019;s degree in accounting/finance or equivalent is preferred</li><li> Strong computer skills are necessary</li><li> Strong understanding of GAAP</li><li> Proven track record for creating process efficiencies and solving problems<br><br></li></ul>KEY COMPETENCIES:<br><br><ul><li> Strong analytic and problem-solving skills</li><li> Organized, detail oriented and accurate</li><li> Excellent oral, written and interpersonal communication skills</li><li> Self-starter</li><li> Demonstrated ability to interface with all levels of management</li><li> Ability to work well within tight deadlines</li><li> Customer service focused and solution oriented<br><br></li></ul><strong>Our Approach to Flexible Work<br><br></strong>With Flex Work, we&#x2019;re combining the best of both worlds: in-person time and remote. Our approach enables our teams to deepen connections, maintain a strong community, and do their best work. We know that flexibility can take shape in many ways, so rather than a number of required days in-office each week, we simply <strong>spend at least half (50%) of our time each quarter in the office or in the field</strong> with our customers, prospects, and partners (depending on role). This means you&apos;ll have the freedom to create a flexible schedule that caters to your business, team, and personal needs, while being intentional to make the most of time spent together. Those in our remote &quot;home office&quot; roles also have the opportunity to come together in our offices for important moments that matter.<br><br><strong>Are you being referred to one of our roles? If so, ask your connection at Workday about our Employee Referral process!<br><br></strong>,<br><br>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"Show more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"Show less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
      "base_salary": {
        "currency": null,
        "max_amount": null,
        "min_amount": null,
        "payment_period": null
      },
      "salary_standards": null,
      "is_easy_apply": false
    },
    {
      "url": "https://www.linkedin.com/jobs/view/accountant-at-sharjah-coop-4268946624?_l=en",
      "job_posting_id": "4268946624",
      "job_title": "Accountant",
      "company_name": "Sharjah Coop",
      "company_id": "2993254",
      "job_location": "Sharjah, Sharjah Emirate, United Arab Emirates",
      "job_summary": "Hub Trading Company is a dynamic business unit under the Sharjah Cooperative Society umbrella, specializing in import, export, and the distribution of diverse product lines across regional and international markets. As we continue to expand our operations, we are looking for a detail-oriented and results-driven Mid-Level Accountant to join our finance team. Job Purpose: The Mid-Level Accountant will be responsible for managing daily accounting operations, ensuring compliance with financial regulations, and supporting the financial planning and analysis process. This role is crucial in providing accurate and timely financial information to support business decisions. Key Responsibilities: Maintain accurate and up-to-date financial records, including general ledger entries, accounts payable/receivable, and bank reconciliations Assist in preparing monthly, quarterly, and annual financial statements and reports Ensure compliance with UAE VAT regulations and assist in VAT filings Monitor and analyze financial data to identify variances, trends, and areas of improvement Coordinate with auditors for internal and external audits Support the budgeting and forecasting processes Review and process supplier invoices, customer billing, and inter-company transactions Manage inventory cost accounting and ensure accurate valuation of stock Participate in process improvements and automation of financial operations Qualifications and Experience: Bachelor’s degree in Accounting, Finance, or a related field Professional certification such as ACCA, CPA, or CMA (preferred but not mandatory) 4–6 years of accounting experience, preferably in import/export, trading, or distribution sectors Strong knowledge of UAE accounting standards and VAT regulations Proficiency in accounting software (e.g., Tally, SAP, Oracle, or similar ERP systems) Advanced Microsoft Excel skills Strong analytical, organizational, and communication skills Ability to work independently and collaboratively in a fast-paced environment Show more Show less",
      "job_seniority_level": "Mid-Senior level",
      "job_function": "Finance",
      "job_employment_type": "Full-time",
      "job_industries": "Retail",
      "job_base_pay_range": null,
      "company_url": "https://ae.linkedin.com/company/sharjah-cooperative-society?trk=public_jobs_topcard-org-name",
      "job_posted_time": "6 months ago",
      "job_num_applicants": 25,
      "discovery_input": {
        "experience_level": null,
        "job_type": null,
        "remote": null,
        "selective_search": null,
        "time_range": null
      },
      "apply_link": null,
      "country_code": null,
      "title_id": "40",
      "company_logo": "https://media.licdn.com/dms/image/v2/C510BAQEBTwpUW6GMmQ/company-logo_100_100/company-logo_100_100/0/1630618744630/sharjah_cooperative_society_logo?e=2147483647&v=beta&t=SNNwoZ8-Y1puS-ELEYYousijItEH0_XiZao1YB1JSwI",
      "job_posted_date": "2025-08-21T19:44:22.975Z",
      "job_poster": {
        "name": null,
        "title": null,
        "url": null
      },
      "application_availability": false,
      "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>Hub Trading Company is a dynamic business unit under the Sharjah Cooperative Society umbrella, specializing in import, export, and the distribution of diverse product lines across regional and international markets. As we continue to expand our operations, we are looking for a detail-oriented and results-driven <strong>Mid-Level Accountant</strong> to join our finance team.</p><p><strong>Job Purpose:</strong></p><p> The Mid-Level Accountant will be responsible for managing daily accounting operations, ensuring compliance with financial regulations, and supporting the financial planning and analysis process. This role is crucial in providing accurate and timely financial information to support business decisions.</p><p><strong>Key Responsibilities:</strong></p><ul><li>Maintain accurate and up-to-date financial records, including general ledger entries, accounts payable/receivable, and bank reconciliations</li><li>Assist in preparing monthly, quarterly, and annual financial statements and reports</li><li>Ensure compliance with UAE VAT regulations and assist in VAT filings</li><li>Monitor and analyze financial data to identify variances, trends, and areas of improvement</li><li>Coordinate with auditors for internal and external audits</li><li>Support the budgeting and forecasting processes</li><li>Review and process supplier invoices, customer billing, and inter-company transactions</li><li>Manage inventory cost accounting and ensure accurate valuation of stock</li><li>Participate in process improvements and automation of financial operations</li></ul><p><strong>Qualifications and Experience:</strong></p><ul><li>Bachelor&#x2019;s degree in Accounting, Finance, or a related field</li><li>Professional certification such as ACCA, CPA, or CMA (preferred but not mandatory)</li><li>4&#x2013;6 years of accounting experience, preferably in import/export, trading, or distribution sectors</li><li>Strong knowledge of UAE accounting standards and VAT regulations</li><li>Proficiency in accounting software (e.g., Tally, SAP, Oracle, or similar ERP systems)</li><li>Advanced Microsoft Excel skills</li><li>Strong analytical, organizational, and communication skills</li><li>Ability to work independently and collaboratively in a fast-paced environment</li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"Show more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"Show less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
      "base_salary": {
        "currency": null,
        "max_amount": null,
        "min_amount": null,
        "payment_period": null
      },
      "salary_standards": null,
      "is_easy_apply": false
    }
  ]